app/Controllers/Admin/DashboardController.php

    public function index()
    {
        $userModel      = new UserModel();
        $domainModel    = new DomainModel();
        $subdomainModel = new SubdomainModel();
        $db             = \Config\Database::connect();

        // --- PENGAMBILAN DATA UNTUK GRAFIK ---
        $sevenDaysAgo = date('Y-m-d', strtotime('-6 days'));

        // Query untuk menghitung jumlah subdomain per hari
        $query = $db->table('subdomains')
            ->select("DATE(created_at) as date, COUNT(id) as count")
            ->where('created_at >=', $sevenDaysAgo)
            ->groupBy('DATE(created_at)')
            ->orderBy('date', 'ASC')
            ->get();
---
SELECT DATE(created_at) as date, COUNT(id) as count
FROM `subdomains`
WHERE `created_at` >= '2025-06-28'
GROUP BY DATE(created_at)
ORDER BY `date` ASC

        // --- AKHIR PENGAMBILAN DATA GRAFIK ---

        // Hitung total data dari setiap tabel
        $data = [
            'totalUsers'      => $userModel->countAllResults(),
            'totalDomains'    => $domainModel->countAllResults(),
            'totalSubdomains' => $subdomainModel->countAllResults(),
            'chartData'       => json_encode($chartData),    // Kirim data sebagai JSON
            'chartLabels'     => json_encode($chartLabels),  // Kirim label sebagai JSON
        ];
---
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `users`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `domains`
SELECT COUNT(*) AS `numrows`
FROM `subdomains`