app/Controllers/Admin/DomainController.php

SELECT *
FROM `domains`
ORDER BY `created_at` DESC
---
    public function index()
    {
        $domainModel = new DomainModel();
        $data = [
            'domains' => $domainModel->orderBy('created_at', 'DESC')->findAll(),
        ];