app/Controllers/Admin/SettingController.php

SELECT *
FROM `app_settings`
WHERE `key` = 'max_subdomains_per_user'
---
    public function index()
    {
        $db = \Config\Database::connect();
        // Gunakan nama tabel baru 'app_settings'
        $setting = $db->table('app_settings')->where('key', 'max_subdomains_per_user')->get()->getRow();