app/Controllers/Admin/SubdomainController.php

    public function index()
    {
        $subdomainModel = new SubdomainModel();

        $data = [
            'subdomains' => $subdomainModel
                ->select('subdomains.*, users.username, domains.domain_name')
                ->join('users', 'users.id = subdomains.user_id')
                ->join('domains', 'domains.id = subdomains.domain_id')
                ->orderBy('subdomains.created_at', 'DESC')
                ->findAll(),
        ];
---
SELECT `subdomains`.*, `users`.`username`, `domains`.`domain_name`
FROM `subdomains`
JOIN `users` ON `users`.`id` = `subdomains`.`user_id`
JOIN `domains` ON `domains`.`id` = `subdomains`.`domain_id`
ORDER BY `subdomains`.`created_at` DESC