app/Controllers/Admin/UserController.php

    public function index()
    {
        $userModel = new UserModel();

        $data = [
            // Ambil semua pengguna dan urutkan berdasarkan yang terbaru
            'users' => $userModel->orderBy('created_at', 'DESC')->findAll(),
---
SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
ORDER BY `created_at` DESC