app/Controllers/DashboardController.php

SELECT *
FROM `domains`
WHERE `is_active` = 1
---
    public function index()
{
    $domainModel    = new DomainModel();
    $subdomainModel = new SubdomainModel();
    $settingModel   = new SettingModel(); // Tambahkan ini

    $userSubdomains = $subdomainModel->getSubdomainsByUser(auth()->id());

    $data = [
        'domains'             => $domainModel->where('is_active', true)->findAll(),
        'subdomains'          => $userSubdomains,
        'current_sub_count'   => count($userSubdomains), // Hitung subdomain saat ini
        'max_subdomains'      => $settingModel->find('max_subdomains_per_user')['value'] ?? '10', // Ambil batas
    ];