app/Models/SubdomainModel.php

SELECT `subdomains`.*, `domains`.`domain_name`
FROM `subdomains`
JOIN `domains` ON `domains`.`id` = `subdomains`.`domain_id`
WHERE `subdomains`.`user_id` = 2
ORDER BY `subdomains`.`created_at` DESC
---
    public function getSubdomainsByUser(int $userId)
    {
        return $this->select('subdomains.*, domains.domain_name')
                    ->join('domains', 'domains.id = subdomains.domain_id')
                    ->where('subdomains.user_id', $userId)
                    ->orderBy('subdomains.created_at', 'DESC')
                    ->findAll();